OS-Q/E131/Libraries/inc/stm8s2.h
/*----------------------------------------------------------------------------*/
/**
  * @brief  16-bit timer with synchro module (TIM5)
  */

typedef struct TIM5_struct
{
  __IO uint8_t CR1;       /*!<TIM5 Control Register 1                */
  __IO uint8_t CR2;       /*!<TIM5 Control Register 2                */
  __IO uint8_t SMCR;      /*!<TIM5 Slave Mode Control Register       */
  __IO uint8_t IER;       /*!<TIM5 Interrupt Enable Register         */
  __IO uint8_t SR1;       /*!<TIM5 Status Register 1                 */
  __IO uint8_t SR2;       /*!<TIM5 Status Register 2                 */
  __IO uint8_t EGR;       /*!<TIM5 Event Generation Register         */
  __IO uint8_t CCMR1;     /*!<TIM5 Capture/Compare Mode Register 1   */
  __IO uint8_t CCMR2;     /*!<TIM5 Capture/Compare Mode Register 2   */
  __IO uint8_t CCMR3;     /*!<TIM5 Capture/Compare Mode Register 3   */
  __IO uint8_t CCER1;     /*!<TIM5 Capture/Compare Enable Register 1 */
  __IO uint8_t CCER2;     /*!<TIM5 Capture/Compare Enable Register 2 */
  __IO uint8_t CNTRH;     /*!<TIM5 Counter High                      */
  __IO uint8_t CNTRL;     /*!<TIM5 Counter Low                       */
  __IO uint8_t PSCR;      /*!<TIM5 Prescaler Register                */
  __IO uint8_t ARRH;      /*!<TIM5 Auto-Reload Register High         */
  __IO uint8_t ARRL;      /*!<TIM5 Auto-Reload Register Low          */
  __IO uint8_t CCR1H;     /*!<TIM5 Capture/Compare Register 1 High   */
  __IO uint8_t CCR1L;     /*!<TIM5 Capture/Compare Register 1 Low    */
  __IO uint8_t CCR2H;     /*!<TIM5 Capture/Compare Register 2 High   */
  __IO uint8_t CCR2L;     /*!<TIM5 Capture/Compare Register 2 Low    */
  __IO uint8_t CCR3H;     /*!<TIM5 Capture/Compare Register 3 High   */
  __IO uint8_t CCR3L;     /*!<TIM5 Capture/Compare Register 3 Low    */
}TIM5_TypeDef;

/** @addtogroup TIM5_Registers_Reset_Value
  * @{
  */

#define TIM5_CR1_RESET_VALUE   ((uint8_t)0x00)
#define TIM5_CR2_RESET_VALUE 	 ((uint8_t)0x00)
#define TIM5_SMCR_RESET_VALUE	 ((uint8_t)0x00)
#define TIM5_IER_RESET_VALUE   ((uint8_t)0x00)
#define TIM5_SR1_RESET_VALUE   ((uint8_t)0x00)
#define TIM5_SR2_RESET_VALUE   ((uint8_t)0x00)
#define TIM5_EGR_RESET_VALUE   ((uint8_t)0x00)
#define TIM5_CCMR1_RESET_VALUE ((uint8_t)0x00)
#define TIM5_CCMR2_RESET_VALUE ((uint8_t)0x00)
#define TIM5_CCMR3_RESET_VALUE ((uint8_t)0x00)
#define TIM5_CCER1_RESET_VALUE ((uint8_t)0x00)
#define TIM5_CCER2_RESET_VALUE ((uint8_t)0x00)
#define TIM5_CNTRH_RESET_VALUE ((uint8_t)0x00)
#define TIM5_CNTRL_RESET_VALUE ((uint8_t)0x00)
#define TIM5_PSCR_RESET_VALUE  ((uint8_t)0x00)
#define TIM5_ARRH_RESET_VALUE  ((uint8_t)0xFF)
#define TIM5_ARRL_RESET_VALUE  ((uint8_t)0xFF)
#define TIM5_CCR1H_RESET_VALUE ((uint8_t)0x00)
#define TIM5_CCR1L_RESET_VALUE ((uint8_t)0x00)
#define TIM5_CCR2H_RESET_VALUE ((uint8_t)0x00)
#define TIM5_CCR2L_RESET_VALUE ((uint8_t)0x00)
#define TIM5_CCR3H_RESET_VALUE ((uint8_t)0x00)
#define TIM5_CCR3L_RESET_VALUE ((uint8_t)0x00)

/**
  * @}
  */

/** @addtogroup TIM5_Registers_Bits_Definition
  * @{
  */
/* CR1*/
#define TIM5_CR1_ARPE           ((uint8_t)0x80) /*!< Auto-Reload Preload Enable mask. */
#define TIM5_CR1_OPM            ((uint8_t)0x08) /*!< One Pulse Mode mask. */
#define TIM5_CR1_URS            ((uint8_t)0x04) /*!< Update Request Source mask. */
#define TIM5_CR1_UDIS           ((uint8_t)0x02) /*!< Update DIsable mask. */
#define TIM5_CR1_CEN            ((uint8_t)0x01) /*!< Counter Enable mask. */
/* CR2*/
#define TIM5_CR2_TI1S 	        ((uint8_t)0x80) /*!< TI1S Selection Mask. */
#define	TIM5_CR2_MMS	          ((uint8_t)0x70) /*!< MMS Selection Mask. */
/* SMCR*/
#define TIM5_SMCR_MSM           ((uint8_t)0x80) /*!< Master/Slave Mode Mask. */
#define TIM5_SMCR_TS            ((uint8_t)0x70) /*!< Trigger Selection Mask. */
#define TIM5_SMCR_SMS           ((uint8_t)0x07) /*!< Slave Mode Selection Mask. */
/*IER*/
#define TIM5_IER_TIE            ((uint8_t)0x40) /*!< Trigger Interrupt Enable mask. */
#define TIM5_IER_CC3IE          ((uint8_t)0x08) /*!< Capture/Compare 3 Interrupt Enable mask. */
#define TIM5_IER_CC2IE          ((uint8_t)0x04) /*!< Capture/Compare 2 Interrupt Enable mask. */
#define TIM5_IER_CC1IE          ((uint8_t)0x02) /*!< Capture/Compare 1 Interrupt Enable mask. */
#define TIM5_IER_UIE            ((uint8_t)0x01) /*!< Update Interrupt Enable mask. */
/*SR1*/
#define TIM5_SR1_TIF            ((uint8_t)0x40) /*!< Trigger Interrupt Flag mask. */
#define TIM5_SR1_CC3IF          ((uint8_t)0x08) /*!< Capture/Compare 3 Interrupt Flag mask. */
#define TIM5_SR1_CC2IF          ((uint8_t)0x04) /*!< Capture/Compare 2 Interrupt Flag mask. */
#define TIM5_SR1_CC1IF          ((uint8_t)0x02) /*!< Capture/Compare 1 Interrupt Flag mask. */
#define TIM5_SR1_UIF            ((uint8_t)0x01) /*!< Update Interrupt Flag mask. */
/*SR2*/
#define TIM5_SR2_CC3OF          ((uint8_t)0x08) /*!< Capture/Compare 3 Overcapture Flag mask. */
#define TIM5_SR2_CC2OF          ((uint8_t)0x04) /*!< Capture/Compare 2 Overcapture Flag mask. */
#define TIM5_SR2_CC1OF          ((uint8_t)0x02) /*!< Capture/Compare 1 Overcapture Flag mask. */
/*EGR*/
#define TIM5_EGR_TG             ((uint8_t)0x40) /*!< Trigger Generation mask. */
#define TIM5_EGR_CC3G           ((uint8_t)0x08) /*!< Capture/Compare 3 Generation mask. */
#define TIM5_EGR_CC2G           ((uint8_t)0x04) /*!< Capture/Compare 2 Generation mask. */
#define TIM5_EGR_CC1G           ((uint8_t)0x02) /*!< Capture/Compare 1 Generation mask. */
#define TIM5_EGR_UG             ((uint8_t)0x01) /*!< Update Generation mask. */
/*CCMR*/
#define TIM5_CCMR_ICxPSC        ((uint8_t)0x0C) /*!< Input Capture x Prescaler mask. */
#define TIM5_CCMR_ICxF          ((uint8_t)0xF0) /*!< Input Capture x Filter mask. */
#define TIM5_CCMR_OCM           ((uint8_t)0x70) /*!< Output Compare x Mode mask. */
#define	TIM5_CCMR_OCxPE         ((uint8_t)0x08) /*!< Output Compare x Preload Enable mask. */
#define TIM5_CCMR_CCxS          ((uint8_t)0x03) /*!< Capture/Compare x Selection mask. */
/*CCER1*/
#define TIM5_CCER1_CC2P         ((uint8_t)0x20) /*!< Capture/Compare 2 output Polarity mask. */
#define TIM5_CCER1_CC2E         ((uint8_t)0x10) /*!< Capture/Compare 2 output enable mask. */
#define TIM5_CCER1_CC1P         ((uint8_t)0x02) /*!< Capture/Compare 1 output Polarity mask. */
#define TIM5_CCER1_CC1E         ((uint8_t)0x01) /*!< Capture/Compare 1 output enable mask. */
/*CCER2*/
#define TIM5_CCER2_CC3P         ((uint8_t)0x02) /*!< Capture/Compare 3 output Polarity mask. */
#define TIM5_CCER2_CC3E         ((uint8_t)0x01) /*!< Capture/Compare 3 output enable mask. */
/*CNTR*/
#define TIM5_CNTRH_CNT          ((uint8_t)0xFF) /*!< Counter Value (MSB) mask. */
#define TIM5_CNTRL_CNT          ((uint8_t)0xFF) /*!< Counter Value (LSB) mask. */
/*PSCR*/
#define TIM5_PSCR_PSC           ((uint8_t)0xFF) /*!< Prescaler Value (MSB) mask. */
/*ARR*/
#define TIM5_ARRH_ARR           ((uint8_t)0xFF) /*!< Autoreload Value (MSB) mask. */
#define TIM5_ARRL_ARR           ((uint8_t)0xFF) /*!< Autoreload Value (LSB) mask. */
/*CCR1*/
#define TIM5_CCR1H_CCR1         ((uint8_t)0xFF) /*!< Capture/Compare 1 Value (MSB) mask. */
#define TIM5_CCR1L_CCR1         ((uint8_t)0xFF) /*!< Capture/Compare 1 Value (LSB) mask. */
/*CCR2*/
#define TIM5_CCR2H_CCR2         ((uint8_t)0xFF) /*!< Capture/Compare 2 Value (MSB) mask. */
#define TIM5_CCR2L_CCR2         ((uint8_t)0xFF) /*!< Capture/Compare 2 Value (LSB) mask. */
/*CCR3*/
#define TIM5_CCR3H_CCR3         ((uint8_t)0xFF) /*!< Capture/Compare 3 Value (MSB) mask. */
#define TIM5_CCR3L_CCR3         ((uint8_t)0xFF) /*!< Capture/Compare 3 Value (LSB) mask. */
/*CCMR*/
#define TIM5_CCMR_TIxDirect_Set ((uint8_t)0x01)
/**
  * @}
  */

