OS-Q/E131/Libraries/inc/stm8s2.h
#define UART1_BRR2_DIVM  ((uint8_t)0xF0) /*!< MSB mantissa of UART1DIV [11:8] mask */
#define UART1_BRR2_DIVF  ((uint8_t)0x0F) /*!< Fraction bits of UART1DIV [3:0] mask */

#define UART1_CR1_R8      ((uint8_t)0x80) /*!< Receive Data bit 8 */
#define UART1_CR1_T8      ((uint8_t)0x40) /*!< Transmit data bit 8 */
#define UART1_CR1_UARTD   ((uint8_t)0x20) /*!< UART1 Disable (for low power consumption) */
#define UART1_CR1_M       ((uint8_t)0x10) /*!< Word length mask */
#define UART1_CR1_WAKE    ((uint8_t)0x08) /*!< Wake-up method mask */
#define UART1_CR1_PCEN    ((uint8_t)0x04) /*!< Parity Control Enable mask */
#define UART1_CR1_PS      ((uint8_t)0x02) /*!< UART1 Parity Selection */
#define UART1_CR1_PIEN    ((uint8_t)0x01) /*!< UART1 Parity Interrupt Enable mask */

#define UART1_CR2_TIEN    ((uint8_t)0x80) /*!< Transmitter Interrupt Enable mask */
#define UART1_CR2_TCIEN   ((uint8_t)0x40) /*!< Transmission Complete Interrupt Enable mask */
#define UART1_CR2_RIEN    ((uint8_t)0x20) /*!< Receiver Interrupt Enable mask */
#define UART1_CR2_ILIEN   ((uint8_t)0x10) /*!< IDLE Line Interrupt Enable mask */
#define UART1_CR2_TEN     ((uint8_t)0x08) /*!< Transmitter Enable mask */
#define UART1_CR2_REN     ((uint8_t)0x04) /*!< Receiver Enable mask */
#define UART1_CR2_RWU     ((uint8_t)0x02) /*!< Receiver Wake-Up mask */
#define UART1_CR2_SBK     ((uint8_t)0x01) /*!< Send Break mask */

#define UART1_CR3_LINEN   ((uint8_t)0x40) /*!< Alternate Function output mask */
#define UART1_CR3_STOP    ((uint8_t)0x30) /*!< STOP bits [1:0] mask */
#define UART1_CR3_CKEN    ((uint8_t)0x08) /*!< Clock Enable mask */
#define UART1_CR3_CPOL    ((uint8_t)0x04) /*!< Clock Polarity mask */
#define UART1_CR3_CPHA    ((uint8_t)0x02) /*!< Clock Phase mask */
#define UART1_CR3_LBCL    ((uint8_t)0x01) /*!< Last Bit Clock pulse mask */

#define UART1_CR4_LBDIEN  ((uint8_t)0x40) /*!< LIN Break Detection Interrupt Enable mask */
#define UART1_CR4_LBDL    ((uint8_t)0x20) /*!< LIN Break Detection Length mask */
#define UART1_CR4_LBDF    ((uint8_t)0x10) /*!< LIN Break Detection Flag mask */
#define UART1_CR4_ADD     ((uint8_t)0x0F) /*!< Address of the UART1 node mask */

#define UART1_CR5_SCEN    ((uint8_t)0x20) /*!< Smart Card Enable mask */
#define UART1_CR5_NACK    ((uint8_t)0x10) /*!< Smart Card Nack Enable mask */
#define UART1_CR5_HDSEL   ((uint8_t)0x08) /*!< Half-Duplex Selection mask */
#define UART1_CR5_IRLP    ((uint8_t)0x04) /*!< Irda Low Power Selection mask */
#define UART1_CR5_IREN    ((uint8_t)0x02) /*!< Irda Enable mask */

/**
  * @}
  */

/*----------------------------------------------------------------------------*/
/**
  * @brief  Universal Synchronous Asynchronous Receiver Transmitter (UART2)
  */

typedef struct UART2_struct
{
  __IO uint8_t SR;   /*!< UART1 status register */
  __IO uint8_t DR;   /*!< UART1 data register */
  __IO uint8_t BRR1; /*!< UART1 baud rate register */
  __IO uint8_t BRR2; /*!< UART1 DIV mantissa[11:8] SCIDIV fraction */
  __IO uint8_t CR1;  /*!< UART1 control register 1 */
  __IO uint8_t CR2;  /*!< UART1 control register 2 */
  __IO uint8_t CR3;  /*!< UART1 control register 3 */
  __IO uint8_t CR4;  /*!< UART1 control register 4 */
  __IO uint8_t CR5;  /*!< UART1 control register 5 */
	__IO uint8_t CR6;  /*!< UART1 control register 6 */
  __IO uint8_t GTR;  /*!< UART1 guard time register */
  __IO uint8_t PSCR; /*!< UART1 prescaler register */
}
UART2_TypeDef;

/** @addtogroup UART2_Registers_Reset_Value
  * @{
  */

#define UART2_SR_RESET_VALUE   ((uint8_t)0xC0)
#define UART2_BRR1_RESET_VALUE ((uint8_t)0x00)
#define UART2_BRR2_RESET_VALUE ((uint8_t)0x00)
#define UART2_CR1_RESET_VALUE  ((uint8_t)0x00)
#define UART2_CR2_RESET_VALUE  ((uint8_t)0x00)
#define UART2_CR3_RESET_VALUE  ((uint8_t)0x00)
#define UART2_CR4_RESET_VALUE  ((uint8_t)0x00)
#define UART2_CR5_RESET_VALUE  ((uint8_t)0x00)
#define UART2_CR6_RESET_VALUE  ((uint8_t)0x00)
#define UART2_GTR_RESET_VALUE  ((uint8_t)0x00)
#define UART2_PSCR_RESET_VALUE ((uint8_t)0x00)

/**
  * @}
  */

/** @addtogroup UART2_Registers_Bits_Definition
  * @{
  */

#define UART2_SR_TXE   ((uint8_t)0x80) /*!< Transmit Data Register Empty mask */
#define UART2_SR_TC    ((uint8_t)0x40) /*!< Transmission Complete mask */
#define UART2_SR_RXNE  ((uint8_t)0x20) /*!< Read Data Register Not Empty mask */
#define UART2_SR_IDLE  ((uint8_t)0x10) /*!< IDLE line detected mask */
#define UART2_SR_OR    ((uint8_t)0x08) /*!< OverRun error mask */
#define UART2_SR_NF    ((uint8_t)0x04) /*!< Noise Flag mask */
#define UART2_SR_FE    ((uint8_t)0x02) /*!< Framing Error mask */
#define UART2_SR_PE    ((uint8_t)0x01) /*!< Parity Error mask */

#define UART2_BRR1_DIVM  ((uint8_t)0xFF) /*!< LSB mantissa of UART2DIV [7:0] mask */

#define UART2_BRR2_DIVM  ((uint8_t)0xF0) /*!< MSB mantissa of UART2DIV [11:8] mask */
#define UART2_BRR2_DIVF  ((uint8_t)0x0F) /*!< Fraction bits of UART2DIV [3:0] mask */

#define UART2_CR1_R8      ((uint8_t)0x80) /*!< Receive Data bit 8 */
#define UART2_CR1_T8      ((uint8_t)0x40) /*!< Transmit data bit 8 */
#define UART2_CR1_UARTD   ((uint8_t)0x20) /*!< UART2 Disable (for low power consumption) */
#define UART2_CR1_M       ((uint8_t)0x10) /*!< Word length mask */
#define UART2_CR1_WAKE    ((uint8_t)0x08) /*!< Wake-up method mask */
#define UART2_CR1_PCEN    ((uint8_t)0x04) /*!< Parity Control Enable mask */
#define UART2_CR1_PS      ((uint8_t)0x02) /*!< UART2 Parity Selection */
#define UART2_CR1_PIEN    ((uint8_t)0x01) /*!< UART2 Parity Interrupt Enable mask */

#define UART2_CR2_TIEN    ((uint8_t)0x80) /*!< Transmitter Interrupt Enable mask */
#define UART2_CR2_TCIEN   ((uint8_t)0x40) /*!< Transmission Complete Interrupt Enable mask */
#define UART2_CR2_RIEN    ((uint8_t)0x20) /*!< Receiver Interrupt Enable mask */
#define UART2_CR2_ILIEN   ((uint8_t)0x10) /*!< IDLE Line Interrupt Enable mask */
#define UART2_CR2_TEN     ((uint8_t)0x08) /*!< Transmitter Enable mask */
#define UART2_CR2_REN     ((uint8_t)0x04) /*!< Receiver Enable mask */
#define UART2_CR2_RWU     ((uint8_t)0x02) /*!< Receiver Wake-Up mask */
#define UART2_CR2_SBK     ((uint8_t)0x01) /*!< Send Break mask */

#define UART2_CR3_LINEN   ((uint8_t)0x40) /*!< Alternate Function output mask */
#define UART2_CR3_STOP    ((uint8_t)0x30) /*!< STOP bits [1:0] mask */
#define UART2_CR3_CKEN    ((uint8_t)0x08) /*!< Clock Enable mask */
#define UART2_CR3_CPOL    ((uint8_t)0x04) /*!< Clock Polarity mask */
#define UART2_CR3_CPHA    ((uint8_t)0x02) /*!< Clock Phase mask */
#define UART2_CR3_LBCL    ((uint8_t)0x01) /*!< Last Bit Clock pulse mask */

#define UART2_CR4_LBDIEN  ((uint8_t)0x40) /*!< LIN Break Detection Interrupt Enable mask */
#define UART2_CR4_LBDL    ((uint8_t)0x20) /*!< LIN Break Detection Length mask */
#define UART2_CR4_LBDF    ((uint8_t)0x10) /*!< LIN Break Detection Flag mask */
#define UART2_CR4_ADD     ((uint8_t)0x0F) /*!< Address of the UART2 node mask */

#define UART2_CR5_SCEN    ((uint8_t)0x20) /*!< Smart Card Enable mask */
#define UART2_CR5_NACK    ((uint8_t)0x10) /*!< Smart Card Nack Enable mask */
#define UART2_CR5_IRLP    ((uint8_t)0x04) /*!< Irda Low Power Selection mask */
#define UART2_CR5_IREN    ((uint8_t)0x02) /*!< Irda Enable mask */

#define UART2_CR6_LDUM    ((uint8_t)0x80) /*!< LIN Divider Update Method */
#define UART2_CR6_LSLV    ((uint8_t)0x20) /*!< LIN Slave Enable */
#define UART2_CR6_LASE    ((uint8_t)0x10) /*!< LIN Auto synchronization Enable */
#define UART2_CR6_LHDIEN  ((uint8_t)0x04) /*!< LIN Header Detection Interrupt Enable */
#define UART2_CR6_LHDF    ((uint8_t)0x02) /*!< LIN Header Detection Flag */
#define UART2_CR6_LSF     ((uint8_t)0x01) /*!< LIN Synch Field */

/**
  * @}
  */


