OS-Q/E131/Libraries/inc/stm8s2.h
/* CAN Interrupt Register bits */
#define CAN_IER_TMEIE  ((uint8_t)0x01)
#define CAN_IER_FMPIE  ((uint8_t)0x02)
#define CAN_IER_FFIE   ((uint8_t)0x04)
#define CAN_IER_FOVIE  ((uint8_t)0x08)
#define CAN_IER_WKUIE  ((uint8_t)0x80)


/* CAN diagnostic Register bits */
#define CAN_DGR_LBKM  ((uint8_t)0x01)
#define CAN_DGR_SLIM  ((uint8_t)0x02)
#define CAN_DGR_SAMP  ((uint8_t)0x04)
#define CAN_DGR_RX    ((uint8_t)0x08)
#define CAN_DGR_TXM2E ((uint8_t)0x10)


/* CAN page select Register bits */
#define CAN_PSR_PS0  ((uint8_t)0x01)
#define CAN_PSR_PS1  ((uint8_t)0x02)
#define CAN_PSR_PS2  ((uint8_t)0x04)

/******************** Tx MailBox & Fifo Page common bits **********************/
#define CAN_MCSR_TXRQ    ((uint8_t)0x01)
#define CAN_MCSR_ABRQ    ((uint8_t)0x02)
#define CAN_MCSR_RQCP    ((uint8_t)0x04)
#define CAN_MCSR_TXOK    ((uint8_t)0x08)
#define CAN_MCSR_ALST    ((uint8_t)0x10)
#define CAN_MCSR_TERR    ((uint8_t)0x20)

#define CAN_MDLCR_DLC    ((uint8_t)0x0F)
#define CAN_MDLCR_TGT    ((uint8_t)0x80)

#define CAN_MIDR1_RTR    ((uint8_t)0x20)
#define CAN_MIDR1_IDE    ((uint8_t)0x40)


/************************* Filter Page ****************************************/

/* CAN Error Status Register bits */
#define CAN_ESR_EWGF     ((uint8_t)0x01)
#define CAN_ESR_EPVF     ((uint8_t)0x02)
#define CAN_ESR_BOFF     ((uint8_t)0x04)
#define CAN_ESR_LEC0     ((uint8_t)0x10)
#define CAN_ESR_LEC1     ((uint8_t)0x20)
#define CAN_ESR_LEC2     ((uint8_t)0x40)
#define CAN_ESR_LEC      ((uint8_t)0x70)

/* CAN Error Status Register bits */
#define CAN_EIER_EWGIE    ((uint8_t)0x01)
#define CAN_EIER_EPVIE    ((uint8_t)0x02)
#define CAN_EIER_BOFIE    ((uint8_t)0x04)
#define CAN_EIER_LECIE    ((uint8_t)0x10)
#define CAN_EIER_ERRIE    ((uint8_t)0x80)

/* CAN transmit error counter Register bits(CAN_TECR) */
#define CAN_TECR_TEC0     ((uint8_t)0x01)
#define CAN_TECR_TEC1     ((uint8_t)0x02)
#define CAN_TECR_TEC2     ((uint8_t)0x04)
#define CAN_TECR_TEC3     ((uint8_t)0x08)
#define CAN_TECR_TEC4     ((uint8_t)0x10)
#define CAN_TECR_TEC5     ((uint8_t)0x20)
#define CAN_TECR_TEC6     ((uint8_t)0x40)
#define CAN_TECR_TEC7     ((uint8_t)0x80)

/* CAN RECEIVE error counter Register bits(CAN_TECR) */
#define CAN_RECR_REC0     ((uint8_t)0x01)
#define CAN_RECR_REC1     ((uint8_t)0x02)
#define CAN_RECR_REC2     ((uint8_t)0x04)
#define CAN_RECR_REC3     ((uint8_t)0x08)
#define CAN_RECR_REC4     ((uint8_t)0x10)
#define CAN_RECR_REC5     ((uint8_t)0x20)
#define CAN_RECR_REC6     ((uint8_t)0x40)
#define CAN_RECR_REC7     ((uint8_t)0x80)

/* CAN filter mode register bits (CAN_FMR) */
#define CAN_FMR1_FML0     ((uint8_t)0x01)
#define CAN_FMR1_FMH0     ((uint8_t)0x02)
#define CAN_FMR1_FML1     ((uint8_t)0x04)
#define CAN_FMR1_FMH1     ((uint8_t)0x08)
#define CAN_FMR1_FML2     ((uint8_t)0x10)
#define CAN_FMR1_FMH2     ((uint8_t)0x20)
#define CAN_FMR1_FML3     ((uint8_t)0x40)
#define CAN_FMR1_FMH3     ((uint8_t)0x80)

#define CAN_FMR2_FML4     ((uint8_t)0x01)
#define CAN_FMR2_FMH4     ((uint8_t)0x02)
#define CAN_FMR2_FML5     ((uint8_t)0x04)
#define CAN_FMR2_FMH5     ((uint8_t)0x08)

/* CAN filter Config register bits (CAN_FCR) */
#define CAN_FCR1_FACT0     ((uint8_t)0x01)
#define CAN_FCR1_FACT1     ((uint8_t)0x10)
#define CAN_FCR2_FACT2     ((uint8_t)0x01)
#define CAN_FCR2_FACT3     ((uint8_t)0x10)
#define CAN_FCR3_FACT4     ((uint8_t)0x01)
#define CAN_FCR3_FACT5     ((uint8_t)0x10)

#define CAN_FCR1_FSC00     ((uint8_t)0x02)
#define CAN_FCR1_FSC01     ((uint8_t)0x04)
#define CAN_FCR1_FSC10     ((uint8_t)0x20)
#define CAN_FCR1_FSC11     ((uint8_t)0x40)
#define CAN_FCR2_FSC20     ((uint8_t)0x02)
#define CAN_FCR2_FSC21     ((uint8_t)0x04)
#define CAN_FCR2_FSC30     ((uint8_t)0x20)
#define CAN_FCR2_FSC31     ((uint8_t)0x40)
#define CAN_FCR3_FSC40     ((uint8_t)0x02)
#define CAN_FCR3_FSC41     ((uint8_t)0x04)
#define CAN_FCR3_FSC50     ((uint8_t)0x20)
#define CAN_FCR3_FSC51     ((uint8_t)0x40)

/**
  * @}
  */

/** @addtogroup CAN_Registers_Reset_Value
  * @{
  */
#define  	CAN_MCR_RESET_VALUE			((uint8_t)0x02)
#define  	CAN_MSR_RESET_VALUE			((uint8_t)0x02)
#define  	CAN_TSR_RESET_VALUE			((uint8_t)0x00)
#define  	CAN_TPR_RESET_VALUE			((uint8_t)0x0C)
#define  	CAN_RFR_RESET_VALUE			((uint8_t)0x00)
#define  	CAN_IER_RESET_VALUE			((uint8_t)0x00)
#define  	CAN_DGR_RESET_VALUE			((uint8_t)0x0C)
#define  	CAN_PSR_RESET_VALUE			((uint8_t)0x00)

#define  	CAN_ESR_RESET_VALUE			((uint8_t)0x00)
#define  	CAN_EIER_RESET_VALUE		        ((uint8_t)0x00)
#define  	CAN_TECR_RESET_VALUE		        ((uint8_t)0x00)
#define  	CAN_RECR_RESET_VALUE		        ((uint8_t)0x00)
#define  	CAN_BTR1_RESET_VALUE		        ((uint8_t)0x40)
#define  	CAN_BTR2_RESET_VALUE		        ((uint8_t)0x23)
#define  	CAN_FMR1_RESET_VALUE		        ((uint8_t)0x00)
#define  	CAN_FMR2_RESET_VALUE		        ((uint8_t)0x00)
#define  	CAN_FCR_RESET_VALUE			((uint8_t)0x00)

#define  	CAN_MFMI_RESET_VALUE			((uint8_t)0x00)
#define  	CAN_MDLC_RESET_VALUE			((uint8_t)0x00)
#define  	CAN_MCSR_RESET_VALUE			((uint8_t)0x00)

/**
  * @}
  */

/**
  * @brief  Configuration Registers (CFG)
  */

typedef struct CFG_struct
{
  __IO uint8_t GCR; /*!< Global Configuration register */
}
CFG_TypeDef;

/** @addtogroup CFG_Registers_Reset_Value
  * @{
  */

#define CFG_GCR_RESET_VALUE ((uint8_t)0x00)

/**
  * @}
  */

/** @addtogroup CFG_Registers_Bits_Definition
  * @{
  */

#define CFG_GCR_SWD ((uint8_t)0x01) /*!< Swim disable bit mask */
#define CFG_GCR_AL  ((uint8_t)0x02) /*!< Activation Level bit mask */

/**
  * @}
  */

/******************************************************************************/
/*                          Peripherals Base Address                          */
/******************************************************************************/

/** @addtogroup MAP_FILE_Base_Addresses
  * @{
  */
#define OPT_BaseAddress         0x4800
#define GPIOA_BaseAddress       0x5000
#define GPIOB_BaseAddress       0x5005
#define GPIOC_BaseAddress       0x500A
#define GPIOD_BaseAddress       0x500F
#define GPIOE_BaseAddress       0x5014
#define GPIOF_BaseAddress       0x5019
#define GPIOG_BaseAddress       0x501E
#define GPIOH_BaseAddress       0x5023
#define GPIOI_BaseAddress       0x5028
#define FLASH_BaseAddress       0x505A
#define EXTI_BaseAddress        0x50A0
#define RST_BaseAddress         0x50B3
#define CLK_BaseAddress         0x50C0
#define WWDG_BaseAddress        0x50D1
#define IWDG_BaseAddress        0x50E0
#define AWU_BaseAddress         0x50F0
#define BEEP_BaseAddress        0x50F3
#define SPI_BaseAddress         0x5200
#define I2C_BaseAddress         0x5210
#define UART1_BaseAddress       0x5230
#define UART2_BaseAddress       0x5240
#define UART3_BaseAddress       0x5240
#define UART4_BaseAddress       0x5230
#define TIM1_BaseAddress        0x5250
#define TIM2_BaseAddress        0x5300
#define TIM3_BaseAddress        0x5320
#define TIM4_BaseAddress        0x5340
#define TIM5_BaseAddress        0x5300
#define TIM6_BaseAddress        0x5340
#define ADC1_BaseAddress        0x53E0
#define ADC2_BaseAddress        0x5400
#define CAN_BaseAddress         0x5420
#define CFG_BaseAddress         0x7F60
#define ITC_BaseAddress         0x7F70
#define DM_BaseAddress          0x7F90

/**
  * @}
  */

/******************************************************************************/
/*                          Peripherals declarations                          */
/******************************************************************************/

#if defined(STM8S105) || defined(STM8S005) || defined(STM8S103) || defined(STM8S003) || \
    defined(STM8S001) || defined(STM8S903) || defined(STM8AF626x) || defined(STM8AF622x)
 #define ADC1 ((ADC1_TypeDef *) ADC1_BaseAddress)
#endif /* (STM8S105)||(STM8S103)||(STM8S005)||(STM8S003)||(STM8S001)||(STM8S903)||(STM8AF626x)||(STM8AF622x)*/

#if defined(STM8S208) || defined(STM8S207) || defined (STM8S007) || defined (STM8AF52Ax) || \
    defined (STM8AF62Ax)
#define ADC2 ((ADC2_TypeDef *) ADC2_BaseAddress)
#endif /* (STM8S208) ||(STM8S207) || (STM8S007) || (STM8AF52Ax) || (STM8AF62Ax) */

#define AWU ((AWU_TypeDef *) AWU_BaseAddress)

